Oryx-Embedded/CycloneCRYPTO/hardware/max32690/max32690_crypto_pkc.c
   //Start MAA operation
   MXC_CTB->maa_ctrl |= CTB_MAA_CTRL_START_Msk;

   //Wait for the MAA operation to complete
   while((MXC_CTB->ctrl & TB_CTRL_MAA_DONE_Msk) == 0)
   {
   }

   //Copy the result
   maaExportScalar(CTB_MAA_MEM_INSTANCE_2, r, orderLen);

   //Release exclusive access to the CTB module
   osReleaseMutex(&max32690CryptoMutex);
}


/**
 * @brief Modular squaring
 * @param[in] curve Elliptic curve parameters
 * @param[out] r Resulting integer R = A^2 mod q
 * @param[in] a An integer such as 0 <= A < q
 **/

void ecScalarSqrMod(const EcCurve *curve, uint32_t *r, const uint32_t *a)
{
   uint_t orderLen;

   //Get the length of the order, in bits
   orderLen = curve->orderSize;

   //Acquire exclusive access to the CTB module
   osAcquireMutex(&max32690CryptoMutex);

   //Reset the engine by setting CTB_CTRL.rst
   MXC_CTB->ctrl = MXC_F_CTB_CTRL_RST;

   //Software must poll the CTB_CTRL.rst bit until it is set to 1 by hardware,
   //indicating the cryptographic accelerator is ready for use
   while((MXC_CTB->ctrl & MXC_F_CTB_CTRL_RDY) == 0)
   {
   }

   //Legacy support for the access behavior of the done flags
   MXC_CTB->ctrl |= MXC_F_CTB_CTRL_FLAG_MODE;

   //Specify the size of the modular operation
   MXC_CTB->maa_maws = orderLen;

   //Copy the operand
   maaImportScalar(CTB_MAA_MEM_INSTANCE_1, a, orderLen);
   //The modulus is always stored in memory instance 5
   maaImportScalar(CTB_MAA_MEM_INSTANCE_5, curve->q, orderLen);

   //Set up a modular square operation
   MXC_CTB->maa_ctrl = CTB_MAA_CTRL_TMA(6) | CTB_MAA_CTRL_RMA(4) |
      CTB_MAA_CTRL_BMA(2) | CTB_MAA_CTRL_AMA(0) |
      CTB_MAA_CTRL_CALC(CTB_MAA_CTRL_CALC_MOD_SQR_Val);

   //Start MAA operation
   MXC_CTB->maa_ctrl |= CTB_MAA_CTRL_START_Msk;

   //Wait for the MAA operation to complete
   while((MXC_CTB->ctrl & TB_CTRL_MAA_DONE_Msk) == 0)
   {
   }

   //Copy the result
   maaExportScalar(CTB_MAA_MEM_INSTANCE_2, r, orderLen);

   //Release exclusive access to the CTB module
   osReleaseMutex(&max32690CryptoMutex);
}

#endif
#if (X25519_SUPPORT == ENABLED || ED25519_SUPPORT == ENABLED)

/**
 * @brief Modular multiplication
 * @param[out] r Resulting integer R = (A * B) mod p
 * @param[in] a An integer such as 0 <= A < p
 * @param[in] b An integer such as 0 <= B < p
 **/

void curve25519Mul2(uint32_t *r, const uint32_t *a, const uint32_t *b)
{
   volatile uint32_t *p;

   //Acquire exclusive access to the CTB module
   osAcquireMutex(&max32690CryptoMutex);

   //Reset the engine by setting CTB_CTRL.rst
   MXC_CTB->ctrl = MXC_F_CTB_CTRL_RST;

   //Software must poll the CTB_CTRL.rst bit until it is set to 1 by hardware,
   //indicating the cryptographic accelerator is ready for use
   while((MXC_CTB->ctrl & MXC_F_CTB_CTRL_RDY) == 0)
   {
   }

   //Legacy support for the access behavior of the done flags
   MXC_CTB->ctrl |= MXC_F_CTB_CTRL_FLAG_MODE;

   //Specify the size of the modular operation
   MXC_CTB->maa_maws = 255;

   //Copy the first operand
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_0);
   p[0] = a[0];
   p[1] = a[1];
   p[2] = a[2];
   p[3] = a[3];
   p[4] = a[4];
   p[5] = a[5];
   p[6] = a[6];
   p[7] = a[7];

   //Copy the second operand
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_1);
   p[0] = b[0];
   p[1] = b[1];
   p[2] = b[2];
   p[3] = b[3];
   p[4] = b[4];
   p[5] = b[5];
   p[6] = b[6];
   p[7] = b[7];

   //The modulus is always stored in memory instance 5
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_5);
   p[0] = 0xFFFFFFED;
   p[1] = 0xFFFFFFFF;
   p[2] = 0xFFFFFFFF;
   p[3] = 0xFFFFFFFF;
   p[4] = 0xFFFFFFFF;
   p[5] = 0xFFFFFFFF;
   p[6] = 0xFFFFFFFF;
   p[7] = 0x7FFFFFFF;

   //Set up a modular multiplication operation
   MXC_CTB->maa_ctrl = CTB_MAA_CTRL_TMA(6) | CTB_MAA_CTRL_RMA(4) |
      CTB_MAA_CTRL_BMA(2) | CTB_MAA_CTRL_AMA(0) |
      CTB_MAA_CTRL_CALC(CTB_MAA_CTRL_CALC_MOD_MUL_Val);

   //Start MAA operation
   MXC_CTB->maa_ctrl |= CTB_MAA_CTRL_START_Msk;

   //Wait for the MAA operation to complete
   while((MXC_CTB->ctrl & TB_CTRL_MAA_DONE_Msk) == 0)
   {
   }

   //Copy the result
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_2);
   r[0] = p[0];
   r[1] = p[1];
   r[2] = p[2];
   r[3] = p[3];
   r[4] = p[4];
   r[5] = p[5];
   r[6] = p[6];
   r[7] = p[7];

   //Release exclusive access to the CTB module
   osReleaseMutex(&max32690CryptoMutex);
}

#endif
#if (X448_SUPPORT == ENABLED || ED448_SUPPORT == ENABLED)

/**
 * @brief Modular multiplication
 * @param[out] r Resulting integer R = (A * B) mod p
 * @param[in] a An integer such as 0 <= A < p
 * @param[in] b An integer such as 0 <= B < p
 **/

void curve448Mul2(uint32_t *r, const uint32_t *a, const uint32_t *b)
{
   volatile uint32_t *p;

   //Acquire exclusive access to the CTB module
   osAcquireMutex(&max32690CryptoMutex);

   //Reset the engine by setting CTB_CTRL.rst
   MXC_CTB->ctrl = MXC_F_CTB_CTRL_RST;

   //Software must poll the CTB_CTRL.rst bit until it is set to 1 by hardware,
   //indicating the cryptographic accelerator is ready for use
   while((MXC_CTB->ctrl & MXC_F_CTB_CTRL_RDY) == 0)
   {
   }

   //Legacy support for the access behavior of the done flags
   MXC_CTB->ctrl |= MXC_F_CTB_CTRL_FLAG_MODE;

   //Specify the size of the modular operation
   MXC_CTB->maa_maws = 448;

   //Copy the first operand
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_0);
   p[0] = (a[1] << 28) | a[0];
   p[1] = (a[2] << 24) | (a[1] >> 4);
   p[2] = (a[3] << 20) | (a[2] >> 8);
   p[3] = (a[4] << 16) | (a[3] >> 12);
   p[4] = (a[5] << 12) | (a[4] >> 16);
   p[5] = (a[6] << 8) | (a[5] >> 20);
   p[6] = (a[7] << 4) | (a[6] >> 24);
   p[7] = (a[9] << 28) | a[8];
   p[8] = (a[10] << 24) | (a[9] >> 4);
   p[9] = (a[11] << 20) | (a[10] >> 8);
   p[10] = (a[12] << 16) | (a[11] >> 12);
   p[11] = (a[13] << 12) | (a[12] >> 16);
   p[12] = (a[14] << 8) | (a[13] >> 20);
   p[13] = (a[15] << 4) | (a[14] >> 24);

   //Copy the second operand
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_1);
   p[0] = (b[1] << 28) | b[0];
   p[1] = (b[2] << 24) | (b[1] >> 4);
   p[2] = (b[3] << 20) | (b[2] >> 8);
   p[3] = (b[4] << 16) | (b[3] >> 12);
   p[4] = (b[5] << 12) | (b[4] >> 16);
   p[5] = (b[6] << 8) | (b[5] >> 20);
   p[6] = (b[7] << 4) | (b[6] >> 24);
   p[7] = (b[9] << 28) | b[8];
   p[8] = (b[10] << 24) | (b[9] >> 4);
   p[9] = (b[11] << 20) | (b[10] >> 8);
   p[10] = (b[12] << 16) | (b[11] >> 12);
   p[11] = (b[13] << 12) | (b[12] >> 16);
   p[12] = (b[14] << 8) | (b[13] >> 20);
   p[13] = (b[15] << 4) | (b[14] >> 24);

   //The modulus is always stored in memory instance 5
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_5);
   p[0] = 0xFFFFFFFF;
   p[1] = 0xFFFFFFFF;
   p[2] = 0xFFFFFFFF;
   p[3] = 0xFFFFFFFF;
   p[4] = 0xFFFFFFFF;
   p[5] = 0xFFFFFFFF;
   p[6] = 0xFFFFFFFF;
   p[7] = 0xFFFFFFFE;
   p[8] = 0xFFFFFFFF;
   p[9] = 0xFFFFFFFF;
   p[10] = 0xFFFFFFFF;
   p[11] = 0xFFFFFFFF;
   p[12] = 0xFFFFFFFF;
   p[13] = 0xFFFFFFFF;

   //Set up a modular multiplication operation
   MXC_CTB->maa_ctrl = CTB_MAA_CTRL_TMA(6) | CTB_MAA_CTRL_RMA(4) |
      CTB_MAA_CTRL_BMA(2) | CTB_MAA_CTRL_AMA(0) |
      CTB_MAA_CTRL_CALC(CTB_MAA_CTRL_CALC_MOD_MUL_Val);

   //Start MAA operation
   MXC_CTB->maa_ctrl |= CTB_MAA_CTRL_START_Msk;

   //Wait for the MAA operation to complete
   while((MXC_CTB->ctrl & TB_CTRL_MAA_DONE_Msk) == 0)
   {
   }

   //Copy the result
   p = (uint32_t *) (MXC_BASE_CTB + CTB_MAA_MEM_INSTANCE_2);
   r[0] = p[0] & 0x0FFFFFFF;
   r[1] = p[0] >> 28 | ((p[1] << 4) & 0x0FFFFFF0);
   r[2] = p[1] >> 24 | ((p[2] << 8) & 0x0FFFFF00);
   r[3] = p[2] >> 20 | ((p[3] << 12) & 0x0FFFF000);
   r[4] = p[3] >> 16 | ((p[4] << 16) & 0x0FFF0000);
   r[5] = p[4] >> 12 | ((p[5] << 20) & 0x0FF00000);
   r[6] = p[5] >> 8 | ((p[6] << 24) & 0x0F000000);
   r[7] = p[6] >> 4;
   r[8] = p[7] & 0x0FFFFFFF;
   r[9] = p[7] >> 28 | ((p[8] << 4) & 0x0FFFFFF0);
   r[10] = p[8] >> 24 | ((p[9] << 8) & 0x0FFFFF00);
   r[11] = p[9] >> 20 | ((p[10] << 12) & 0x0FFFF000);
   r[12] = p[10] >> 16 | ((p[11] << 16) & 0x0FFF0000);
   r[13] = p[11] >> 12 | ((p[12] << 20) & 0x0FF00000);
   r[14] = p[12] >> 8 | ((p[13] << 24) & 0x0F000000);
   r[15] = p[13] >> 4;

   //Release exclusive access to the CTB module
   osReleaseMutex(&max32690CryptoMutex);
}

#endif
#endif
